uhnp/src/InformationRegisters/АналитикаПланированияСтатейБюджетов/АналитикаПланированияСтатейБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаПланированияСтатейБюджетов</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтатейБюджетов</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/КлючиАналитикиПланированияСтатейБюджетов/КлючиАналитикиПланированияСтатейБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиАналитикиПланированияСтатейБюджетов</name>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/АналитикаПланированияСтатейБюджетов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает информацию о ключе
Функция ИнформацияОКлюче() Экспорт

	//
	Результат = Новый Структура;
	Результат.Вставить("СправочникИмя", "КлючиАналитикиПланированияСтатейБюджетов");
	Результат.Вставить("СправочникМенеджер", Справочники.КлючиАналитикиПланированияСтатейБюджетов);
	Результат.Вставить("СправочникМетаданные", Метаданные.Справочники.КлючиАналитикиПланированияСтатейБюджетов);
	Результат.Вставить("РегистрИмя", "АналитикаПланированияСтатейБюджетов");
	Результат.Вставить("РегистрМенеджер", РегистрыСведений.АналитикаПланированияСтатейБюджетов);
	Результат.Вставить("РегистрМетаданные", Метаданные.РегистрыСведений.АналитикаПланированияСтатейБюджетов);
	
	Результат.Вставить("ИмяПоляАналитика", "АналитикаПланированияСтатейБюджетов");
	
	КонтрольУХКлючи.ДобавитьИзмеренияКлюча(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПолноеНаименованиеКлючаАналитики(МенеджерЗаписи) Экспорт

	ЕстьАналитика = Истина;
	Если МенеджерЗаписи.Аналитика1 = неопределено
		И МенеджерЗаписи.Аналитика2 = неопределено
		И МенеджерЗаписи.Аналитика3 = неопределено
		И МенеджерЗаписи.Аналитика4 = неопределено
		И МенеджерЗаписи.Аналитика5 = неопределено
		И МенеджерЗаписи.Аналитика6 = неопределено Тогда
		ЕстьАналитика = Ложь;
	КонецЕсли;
	
	Имя = СокрЛП(МенеджерЗаписи.СтатьяБюджета);
	Если ЕстьАналитика Тогда
		Имя = Имя + " ("
			+ ?(ЗначениеЗаполнено(МенеджерЗаписи.Аналитика1), СокрЛП(МенеджерЗаписи.Аналитика1), " - ") + "; "
			+ ?(ЗначениеЗаполнено(МенеджерЗаписи.Аналитика2), СокрЛП(МенеджерЗаписи.Аналитика2), " - ") + "; "
			+ ?(ЗначениеЗаполнено(МенеджерЗаписи.Аналитика3), СокрЛП(МенеджерЗаписи.Аналитика3), " - ") + "; "
			+ ?(ЗначениеЗаполнено(МенеджерЗаписи.Аналитика4), СокрЛП(МенеджерЗаписи.Аналитика4), " - ") + "; "
			+ ?(ЗначениеЗаполнено(МенеджерЗаписи.Аналитика5), СокрЛП(МенеджерЗаписи.Аналитика5), " - ") + "; "
			+ ?(ЗначениеЗаполнено(МенеджерЗаписи.Аналитика6), СокрЛП(МенеджерЗаписи.Аналитика6), " - ") + ")";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МенеджерЗаписи.ПриходРасход) Тогда
		Имя = Имя + " " + СокрЛП(МенеджерЗаписи.ПриходРасход);
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

// Функция получает элемент справочника - ключ аналитики планирования статей бюджетов.
//
// Параметры:
//	ПараметрыАналитики - Выборка, Структура - Содержит полями "СтатьяБюджета, Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5, Аналитика6, ПриходРасход":
//		* СтатьяБюджета - СправочникСсылка.СтатьиДвиженияДенежныхСредств, СтатьиДоходовРасходов, СтатьиДвиженияРесурсов.
//		* Аналитика1-3 - ХарактеристикаСсылка.ВидыСубконтоКорпоративные.
//		* ПриходРасход - ПеречислениеСсылка.ВидыДвиженийПриходРасход
//
// Возвращаемое значение:
//	СправочникСсылка.КлючиАналитикиПланированияСтатьейБюджетов - Созданный элемент справочника.
//
Функция ЗначениеКлючаАналитики(ПараметрыАналитики) Экспорт

	НаборЗаписей = ПолучитьНаборЗаписей(ПараметрыАналитики);
	
	Если НаборЗаписей <> Неопределено Тогда
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0
			И Не ЗначениеЗаполнено(НаборЗаписей[0].КлючАналитики) Тогда
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли;

		Если НаборЗаписей.Количество() > 0
			И ЗначениеЗаполнено(НаборЗаписей[0].КлючАналитики) Тогда
			Результат = НаборЗаписей[0].КлючАналитики;
		Иначе
			Результат = СоздатьКлючАналитики(ПараметрыАналитики);
		КонецЕсли;

		Возврат Результат;
	КонецЕсли;

КонецФункции

// Функция получает элемент справочника - ключ аналитики планирования.
//
// Параметры:
//	ПараметрыАналитики - Выборка или Структура  с полями "СтатьяБюджета, Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5, Аналитика6, ПриходРасход".
//
// Возвращаемое значение:
//	СправочникСсылка.КлючиАналитикиПланированияСтатейБюджетов - Созданный элемент справочника.
//
Функция СоздатьКлючАналитики(ПараметрыАналитики, ЗаписьПриОбновленииИБ = Ложь) Экспорт
	
	Возврат КонтрольУХКлючи.СоздатьКлючАналитики(ИнформацияОКлюче(), ПараметрыАналитики);
	
КонецФункции

// Заполняет поле АналитикаПланированияСтатейБюджетов в коллекции, содержащей статью бюджета, аналитику1-3, Направление.
//
// Параметры:
//
//	Коллекция - ТабличнаяЧасть - Коллекция, в которой производится заполнение аналитики планирования статей бюджетов.
//
//	ИменаПолей - Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//		содержит две секции, если значение ключа Неопределено, то имя поля берется из имени ключа.
//		секция идентификации {СтатьяБюджета, Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5, Аналитика6, ПриходРасход, АналитикаПланированияСтатейБюджета},
//	
//	ПараметрыЗаполнения - Структура - см. метод КонтрольУХКлючи.ПараметрыЗаполненияКлючейАналитики()
//
// Пример 1:
//	ИменаПолей = РегистрыСведений.АналитикаПланированияСтатейБюджетов.ИменаПолейКоллекцииПоУмолчанию();
//	РегистрыСведений.АналитикаПланированияСтатейБюджетов.ЗаполнитьВКоллекции(ДвиженияОперации, ИменаПолей);
//
// Пример 2:
//	РегистрыСведений.АналитикаПланированияСтатейБюджетов.ЗаполнитьВКоллекции(ДвиженияОперации);
//
Процедура ЗаполнитьВКоллекции(Коллекция, 
								ИменаПолей = Неопределено, ДополнитьКлюч = Ложь, ПараметрыЗаполнения = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыЗаполнения = Неопределено Тогда
		ПараметрыЗаполнения = КонтрольУХКлючи.ПараметрыЗаполненияКлючейАналитики();
	КонецЕсли;
	
	КонтрольУХКлючи.ПривестиКолонкуКТипу(Коллекция, ИменаПолей.СтатьяБюджета, Метаданные.ПланыВидовХарактеристик.ВидыБюджетов.Тип);
	КонтрольУХКлючи.ПривестиКолонкуКТипу(Коллекция, ИменаПолей.Аналитика1, Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип);
	КонтрольУХКлючи.ПривестиКолонкуКТипу(Коллекция, ИменаПолей.Аналитика2, Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип);
	КонтрольУХКлючи.ПривестиКолонкуКТипу(Коллекция, ИменаПолей.Аналитика3, Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип);
	КонтрольУХКлючи.ПривестиКолонкуКТипу(Коллекция, ИменаПолей.Аналитика4, Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип);
	КонтрольУХКлючи.ПривестиКолонкуКТипу(Коллекция, ИменаПолей.Аналитика5, Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип);
	КонтрольУХКлючи.ПривестиКолонкуКТипу(Коллекция, ИменаПолей.Аналитика6, Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип);
	КонтрольУХКлючи.ПривестиКолонкуКТипу(Коллекция, ИменаПолей.ПриходРасход, Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДвиженийПриходРасход"));
	
	Если ДополнитьКлюч Тогда
		Если ИменаПолей = Неопределено Тогда
			ИменаПолей = ИменаПолейДополненияКоллекцииПоУмолчанию();
		КонецЕсли;
		Запрос = Новый Запрос(ТекстДополнениеКлючейАналитикиВКоллекции(ИменаПолей));
		Запрос.УстановитьПараметр("Коллекция", Коллекция);
	Иначе
		Если ИменаПолей = Неопределено Тогда
			ИменаПолей = ИменаПолейКоллекцииПоУмолчанию();
		КонецЕсли;
		Запрос = Новый Запрос(ТекстЗначенияКлючейАналитикиВКоллекции(ИменаПолей));
		Запрос.УстановитьПараметр("Коллекция", Коллекция);
		
		Если ЗначениеЗаполнено(ИменаПолей.ПриходРасход)
			И ТипЗнч(ИменаПолей.ПриходРасход) = Тип("Структура")
			И ИменаПолей.ПриходРасход.Свойство("Значение") Тогда
			Запрос.УстановитьПараметр("ПриходРасход", ИменаПолей.ПриходРасход.Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.АналитикаПланированияСтатейБюджетов) Тогда
			Если ПараметрыЗаполнения.СоздаватьВКлючи Тогда
				КлючАналитики = ЗначениеКлючаАналитики(Выборка);
			Иначе
				ТекстИсключения = НСтр("ru = 'Ошибка при заполнении ключей в коллекции: есть аналитики, по которым ключи еще не созданы.'");
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.КлючиАналитикиПланированияСтатейБюджетов,
					,
					ТекстИсключения);
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
		Иначе
			КлючАналитики = Выборка.АналитикаПланированияСтатейБюджетов;
		КонецЕсли;
		
		ПараметрыЗаполнения.ИзмененаАналитика = Истина;
		Если Не ПараметрыЗаполнения.ЗаполнятьКлючВКоллекции Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДополнитьКлюч Тогда
			Коллекция[Выборка.Индекс][ИменаПолей.ЗаполняемаяАналитикаПланированияСтатейБюджетов] = КлючАналитики;
		Иначе
			Коллекция[Выборка.Индекс][ИменаПолей.АналитикаПланированияСтатейБюджетов] = КлючАналитики;
		КонецЕсли;  
		
	КонецЦикла;  
	
КонецПроцедуры

// Возвращает структуру полей выбора информации из коллекции для формирования аналитики планирования статей бюджетов.
//
// Возвращаемое значение:
//	Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//		содержит две секции, если значение ключа Неопределено, то имя поля должно браться из имени ключа.
//		секция идентификации {СтатьяБюджета, Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5, Аналитика6, АналитикаПланированияСтатейБюджетов, ПриходРасход},
//			все ключи заданы.
//
Функция ИменаПолейКоллекцииПоУмолчанию() Экспорт
	
	ИменаПолей = Новый Структура();
	ИменаПолей.Вставить("СтатьяБюджета", "СтатьяБюджета");
	ИменаПолей.Вставить("Аналитика1", "Аналитика1");
	ИменаПолей.Вставить("Аналитика2", "Аналитика2");
	ИменаПолей.Вставить("Аналитика3", "Аналитика3");
	ИменаПолей.Вставить("Аналитика4", "Аналитика4");
	ИменаПолей.Вставить("Аналитика5", "Аналитика5");
	ИменаПолей.Вставить("Аналитика6", "Аналитика6");
	ИменаПолей.Вставить("ПриходРасход", "ПриходРасход");
	ИменаПолей.Вставить("АналитикаПланированияСтатейБюджетов", "АналитикаПланированияСтатейБюджетов");
	
	Возврат ИменаПолей;
КонецФункции

// Возвращает структуру полей выбора информации из коллекции для формирования аналитики планирования статей бюджетов.
//
// Возвращаемое значение:
//	Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//
Функция ИменаПолейДополненияКоллекцииПоУмолчанию() Экспорт
	
	ИменаПолей = Новый Структура();
	ИменаПолей.Вставить("АналитикаПланированияСтатейБюджетов", "АналитикаПланированияСтатейБюджетов");
	ИменаПолей.Вставить("ЗаполняемаяАналитикаПланированияСтатейБюджетов", "АналитикаПланированияСтатейБюджетов");
	ИменаПолей.Вставить("СтатьяБюджета", "");
	ИменаПолей.Вставить("Аналитика1", "");
	ИменаПолей.Вставить("Аналитика2", "");
	ИменаПолей.Вставить("Аналитика3", "");
	ИменаПолей.Вставить("Аналитика4", "");
	ИменаПолей.Вставить("Аналитика5", "");
	ИменаПолей.Вставить("Аналитика6", "");
	ИменаПолей.Вставить("ПриходРасход", "");
	
	Возврат ИменаПолей;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Функция ПолучитьНаборЗаписей(ПараметрыАналитики)
	
	// В параметрах аналитики могут быть не все свойства
	СтруктураАналитики = Новый Структура("СтатьяБюджета, Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5, Аналитика6, ПриходРасход");
	ЗаполнитьЗначенияСвойств(СтруктураАналитики, ПараметрыАналитики);
	Если НЕ ЗначениеЗаполнено(СтруктураАналитики.СтатьяБюджета)
	 И НЕ ЗначениеЗаполнено(СтруктураАналитики.Аналитика1)
	 И НЕ ЗначениеЗаполнено(СтруктураАналитики.Аналитика2) 
	 И НЕ ЗначениеЗаполнено(СтруктураАналитики.Аналитика3)
	 И НЕ ЗначениеЗаполнено(СтруктураАналитики.Аналитика4)
	 И НЕ ЗначениеЗаполнено(СтруктураАналитики.Аналитика5)
	 И НЕ ЗначениеЗаполнено(СтруктураАналитики.Аналитика6)
	 И НЕ ЗначениеЗаполнено(СтруктураАналитики.ПриходРасход) Тогда
		Возврат Неопределено
	Иначе
		НаборЗаписей = РегистрыСведений.АналитикаПланированияСтатейБюджетов.СоздатьНаборЗаписей();
		
		Для Каждого КлючЗначение Из СтруктураАналитики Цикл
			НаборЗаписей.Отбор[КлючЗначение.Ключ].Установить(КлючЗначение.Значение);
		КонецЦикла;
		
		НоваяСтрока = НаборЗаписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураАналитики, "СтатьяБюджета, Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5, Аналитика6, ПриходРасход");
		//ПроверитьЗаполнениеПоляСтатьяБюджета(НоваяСтрока);
		Возврат НаборЗаписей;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьЗаполнениеПоляСтатьяБюджета(МенеджерЗаписиАналитикаПланированияСтатейБюджетов)

	Если МенеджерЗаписиАналитикаПланированияСтатейБюджетов.СтатьяБюджета = Неопределено 
		Тогда
		ВызватьИсключение НСтр("ru = 'Ошибочное значение параметра ""Статья бюджета""'");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеКлючейАналитикиВКоллекции

Функция ТекстЗначенияКлючейАналитикиВКоллекции(ИменаПолей)
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Коллекция.НомерСтроки - 1 КАК Индекс,
		|	&ПолеАналитикаПланирования КАК АналитикаПланированияСтатейБюджетов,
		|	&ПолеСтатьяБюджета КАК СтатьяБюджета,
		|	&ПолеАналитика1 КАК Аналитика1,
		|	&ПолеАналитика2 КАК Аналитика2,
		|	&ПолеАналитика3 КАК Аналитика3,
		|	&ПолеАналитика4 КАК Аналитика4,
		|	&ПолеАналитика5 КАК Аналитика5,
		|	&ПолеАналитика6 КАК Аналитика6,
		|	&ПолеПриходРасход КАК ПриходРасход
		|
		|ПОМЕСТИТЬ Коллекция
		|ИЗ &Коллекция КАК Коллекция;
		|
		|ВЫБРАТЬ
		|	Коллекция.Индекс,
		|	Аналитика.КлючАналитики КАК АналитикаПланированияСтатейБюджетов,
		|	Коллекция.СтатьяБюджета,
		|	Коллекция.Аналитика1,
		|	Коллекция.Аналитика2,
		|	Коллекция.Аналитика3,
		|	Коллекция.Аналитика4,
		|	Коллекция.Аналитика5,
		|	Коллекция.Аналитика6,
		|	Коллекция.ПриходРасход
		|ИЗ
		|	Коллекция КАК Коллекция
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПланированияСтатейБюджетов КАК Аналитика
		|		ПО Аналитика.СтатьяБюджета = Коллекция.СтатьяБюджета
		|		И Аналитика.Аналитика1 = Коллекция.Аналитика1
		|		И Аналитика.Аналитика2 = Коллекция.Аналитика2
		|		И Аналитика.Аналитика3 = Коллекция.Аналитика3
		|		И Аналитика.Аналитика4 = Коллекция.Аналитика4
		|		И Аналитика.Аналитика5 = Коллекция.Аналитика5
		|		И Аналитика.Аналитика6 = Коллекция.Аналитика6
		|		И Аналитика.ПриходРасход = Коллекция.ПриходРасход
		|ГДЕ
		|	Аналитика.КлючАналитики ЕСТЬ NULL
		|	ИЛИ Аналитика.КлючАналитики <> Коллекция.АналитикаПланированияСтатейБюджетов
		|	ИЛИ Аналитика.КлючАналитики = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПланированияСтатейБюджетов.ПустаяСсылка)
		|";
	
	// заменим в тексте запроса подставляемые поля из структуры ИменаПолей
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитикаПланирования", "Коллекция." + ИменаПолей.АналитикаПланированияСтатейБюджетов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеСтатьяБюджета", "Коллекция." + ИменаПолей.СтатьяБюджета);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика1", "Коллекция." + ИменаПолей.Аналитика1);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика2", "Коллекция." + ИменаПолей.Аналитика2);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика3", "Коллекция." + ИменаПолей.Аналитика3);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика4", "Коллекция." + ИменаПолей.Аналитика4);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика5", "Коллекция." + ИменаПолей.Аналитика5);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика6", "Коллекция." + ИменаПолей.Аналитика6);
	
	// Поле ПриходРасход может отсутствовать в таблице.
	Если ЗначениеЗаполнено(ИменаПолей.ПриходРасход) Тогда
		Если ТипЗнч(ИменаПолей.ПриходРасход) = Тип("Структура") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриходРасход", ИменаПолей.ПриходРасход.ТекстПоля);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриходРасход", "Коллекция." + ИменаПолей.ПриходРасход);
		КонецЕсли;  
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриходРасход", "ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.ПустаяСсылка)");
	КонецЕсли; 
	
	Возврат ТекстЗапроса;    
	
КонецФункции

Функция ТекстДополнениеКлючейАналитикиВКоллекции(ИменаПолей)
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Коллекция.НомерСтроки - 1 КАК Индекс,
		|	&ПолеАналитика            КАК АналитикаПланированияСтатейБюджетов,
		|	&ПолеПриемник             КАК АналитикаПланированияСтатейБюджетовПриемник,
		|	&ПолеСтатьяБюджета        КАК СтатьяБюджета,
		|	&ПолеАналитика1			  КАК Аналитика1,
		|	&ПолеАналитика2			  КАК Аналитика2,
		|	&ПолеАналитика3			  КАК Аналитика3,
		|	&ПолеАналитика4			  КАК Аналитика4,
		|	&ПолеАналитика5			  КАК Аналитика5,
		|	&ПолеАналитика6			  КАК Аналитика6,
		|	&ПолеПриходРасход		  КАК ПриходРасход
		|ПОМЕСТИТЬ ВтКоллекция
		|ИЗ &Коллекция КАК Коллекция
		|;
		|ВЫБРАТЬ
		|	Коллекция.Индекс                       КАК Индекс,
		|	Коллекция.АналитикаПланированияСтатейБюджетов КАК АналитикаПланированияСтатейБюджетов,
		|	Коллекция.АналитикаПланированияСтатейБюджетовПриемник КАК АналитикаПланированияСтатейБюджетовПриемник,
		|	ВЫБОР КОГДА Коллекция.СтатьяБюджета = неопределено
		|		ТОГДА ЕСТЬNULL(Аналитика.СтатьяБюджета, неопределено)
		|		ИНАЧЕ Коллекция.СтатьяБюджета
		|	КОНЕЦ                                КАК СтатьяБюджета,
		|	ВЫБОР КОГДА Коллекция.Аналитика1 = неопределено
		|		ТОГДА ЕСТЬNULL(Аналитика.Аналитика1, неопределено)
		|		ИНАЧЕ Коллекция.Аналитика1
		|	КОНЕЦ                                КАК Аналитика1,
		|	ВЫБОР КОГДА Коллекция.Аналитика2 = неопределено
		|		ТОГДА ЕСТЬNULL(Аналитика.Аналитика2, неопределено)
		|		ИНАЧЕ Коллекция.Аналитика2
		|	КОНЕЦ                                КАК Аналитика2,
		|	ВЫБОР КОГДА Коллекция.Аналитика3 = неопределено
		|		ТОГДА ЕСТЬNULL(Аналитика.Аналитика3, неопределено)
		|		ИНАЧЕ Коллекция.Аналитика3
		|	КОНЕЦ                                КАК Аналитика3,
		|	ВЫБОР КОГДА Коллекция.Аналитика4 = неопределено
		|		ТОГДА ЕСТЬNULL(Аналитика.Аналитика4, неопределено)
		|		ИНАЧЕ Коллекция.Аналитика4
		|	КОНЕЦ                                КАК Аналитика4,
		|	ВЫБОР КОГДА Коллекция.Аналитика5 = неопределено
		|		ТОГДА ЕСТЬNULL(Аналитика.Аналитика5, неопределено)
		|		ИНАЧЕ Коллекция.Аналитика5
		|	КОНЕЦ                                КАК Аналитика5,
		|	ВЫБОР КОГДА Коллекция.Аналитика6 = неопределено
		|		ТОГДА ЕСТЬNULL(Аналитика.Аналитика6, неопределено)
		|		ИНАЧЕ Коллекция.Аналитика6
		|	КОНЕЦ                                КАК Аналитика6,
		|	Коллекция.ПриходРасход               КАК ПриходРасход
		|ПОМЕСТИТЬ Коллекция
		|ИЗ
		|	ВтКоллекция КАК Коллекция
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПланированияСтатейБюджетов КАК Аналитика
		|	ПО Коллекция.АналитикаПланированияСтатейБюджетов = Аналитика.КлючАналитики
		|;
		|ВЫБРАТЬ
		|	Коллекция.Индекс КАК Индекс,
		|	Ключи.КлючАналитики КАК АналитикаПланированияСтатейБюджетов,
		|	Коллекция.СтатьяБюджета КАК СтатьяБюджета,
		|	Коллекция.Аналитика1 КАК Аналитика1,
		|	Коллекция.Аналитика2 КАК Аналитика2,
		|	Коллекция.Аналитика3 КАК Аналитика3,
		|	Коллекция.Аналитика4 КАК Аналитика4,
		|	Коллекция.Аналитика5 КАК Аналитика5,
		|	Коллекция.Аналитика6 КАК Аналитика6,
		|	Коллекция.ПриходРасход КАК ПриходРасход
		|ИЗ
		|	Коллекция КАК Коллекция
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПланированияСтатейБюджетов КАК Ключи
		|	ПО Ключи.СтатьяБюджета = Коллекция.СтатьяБюджета
		|		И Ключи.Аналитика1 = Коллекция.Аналитика1
		|		И Ключи.Аналитика2 = Коллекция.Аналитика2
		|		И Ключи.Аналитика3 = Коллекция.Аналитика3
		|		И Ключи.Аналитика4 = Коллекция.Аналитика4
		|		И Ключи.Аналитика5 = Коллекция.Аналитика5
		|		И Ключи.Аналитика6 = Коллекция.Аналитика6
		|		И Ключи.ПриходРасход = Коллекция.ПриходРасход
		|ГДЕ
		|	Ключи.КлючАналитики ЕСТЬ NULL
		|	ИЛИ Ключи.КлючАналитики <> Коллекция.АналитикаПланированияСтатейБюджетов
		|	ИЛИ Коллекция.АналитикаПланированияСтатейБюджетовПриемник = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПланированияСтатейБюджетов.ПустаяСсылка)
		|";
	
	// заменим в тексте запроса подставляемые поля из структуры ИменаПолей
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика", "Коллекция." + ИменаПолей.АналитикаПланированияСтатейБюджетов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриемник", "Коллекция." + ИменаПолей.ЗаполняемаяАналитикаПланированияСтатейБюджетов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеСтатьяБюджета", ?(ЗначениеЗаполнено(ИменаПолей.СтатьяБюджета),"Коллекция." + ИменаПолей.СтатьяБюджета, "неопределено"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика1", ?(ЗначениеЗаполнено(ИменаПолей.Аналитика1),"Коллекция." + ИменаПолей.Аналитика1, "неопределено"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика2", ?(ЗначениеЗаполнено(ИменаПолей.Аналитика2),"Коллекция." + ИменаПолей.Аналитика2, "неопределено"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика3", ?(ЗначениеЗаполнено(ИменаПолей.Аналитика3),"Коллекция." + ИменаПолей.Аналитика3, "неопределено"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика4", ?(ЗначениеЗаполнено(ИменаПолей.Аналитика4),"Коллекция." + ИменаПолей.Аналитика4, "неопределено"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика5", ?(ЗначениеЗаполнено(ИменаПолей.Аналитика5),"Коллекция." + ИменаПолей.Аналитика5, "неопределено"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика6", ?(ЗначениеЗаполнено(ИменаПолей.Аналитика6),"Коллекция." + ИменаПолей.Аналитика6, "неопределено"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриходРасход", ?(ЗначениеЗаполнено(ИменаПолей.ПриходРасход),"Коллекция." + ИменаПолей.ПриходРасход, "ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.ПустаяСсылка)"));
	
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
